app/views/gossip/new.html.erb

SELECT "users".* FROM "users"
---
          <%= "Qui es tu ?" %>
          <%= select nil, 'user', User.all.collect { |u| [ u.first_name, u.id ] }, { include_blank: true } %>

SELECT "tags".* FROM "tags"
---
          <%= "Quelle catégorie ?" %>
          <%= select nil, 'tag', Tag.all.collect { |t| [ t.title, t.id ] }, { include_blank: true } %>