app/views/gossip/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
---
                                    <span class="mr-2 d-block d-sm-inline-block mb-2 mb-sm-0">Contribution :</span>
                                    <span class="bg-dark text-white"> <%= @gossip.user.first_name %></span>