app/views/home/show.html.erb

  <div class="d-flex flex-wrap justify-content-center">
  <% Gossip.all.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips"

    <div class="card-body">
      <h5 class="card-title">Potin numéro <%= Gossip.all.index(gossip) + 1 %></h5>
      <p class="card-text">"<%= gossip.title.capitalize %>"</p>
      <p class="card-text">Contributeur : <%= User.find(gossip.user_id).first_name %></p>
---
SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]