app/controllers/gossip_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])

INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "coucou"], ["content", "coucou"], ["created_at", "2021-11-02 17:42:21.275631"], ["updated_at", "2021-11-02 17:42:21.275631"], ["user_id", 60]]
---
  def create
  # gossip = Gossip.create(title: params[:gossip_title], content: params[:gossip_content], user_id: params[:user])
  # redirect_to gossip_path(gossip.id)
  puts params
  @gossip = Gossip.new(title: params[:gossip_title], content: params[:gossip_content])
  @gossip.save