app/controllers/profile_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 62]]
---
  def show
    @author = User.find(params[:id])
    @gossips = Gossip.where(user_id: params[:id])